package bazi

/*
十神是以某個五行爲中心，按五行生克關系劃分的，八字中日幹代表自己，其他字以日幹爲中心來定義十神，每個十神代表着一定的類象詳見《子平真詮》等，用來批斷人的命運特征。以日幹爲中心，見到什麼字馬上就知道他代表哪個十神，這是最關鍵的基本功。
利用天幹和地支來準確記錄年、月、日、時的方式，由“年幹，年支”、“月幹，月支”、“日幹，日支”、“時幹，時支”，共八個幹支所組成（共八個字），年、月、日、時的幹支組合稱爲“柱”，形成“年柱”、“月柱”、“日柱”、“時柱”。唐朝時期，初以年柱爲主體，以生年幹爲本命，輔以納音法推命。唐代的李虛中改以年爲主，取年、月、日、時四柱推命。五代的徐子平改以日幹爲我（日主），查四柱間之五行生克制化、刑沖會合爲推命重點，並發揚光大。當今的八字推命中，四柱即：“年柱”、“月柱”、“日柱”、“時柱”，由“年幹，年支”、“月幹，月支”、“日幹，日支”、“時幹，時支”，共八個幹支所組成（正好八個字）。每一個組合稱爲“柱”，形成“年柱”、“月柱”、“日柱”、“時柱”，故八字又稱爲“四柱”或“四柱八字”。以日幹爲我（日主，命主），查四柱間的五行生克制化、刑沖會合爲推命的重點。 [1]

因五行有五種，所以八字中與日幹的關系有五種，細分陰陽爲十，所以有十神。同性爲偏，異性爲正。
1、生我者爲梟印。同性爲偏印，也叫梟神，簡稱梟；異性爲正印，簡稱印。比如日幹爲甲木，壬、亥爲偏印，癸、子則爲正印。
2、同我者爲比劫。同性爲比肩，簡稱比；異性爲劫財，簡稱劫。比如日幹爲甲，甲、寅爲比肩，乙卯爲劫財。
3、我生者爲食傷。同性爲食神，簡稱食；異性爲傷官，簡稱傷。比如日幹爲甲，丙午爲食神，丁巳爲傷官。
4、我克者爲才財。同性爲偏財，簡稱財；異性爲正財，簡稱才（貝）（在台灣香港等地區，正財簡稱“財”，偏財簡稱“才”，因劫財簡稱“劫”，故正財應簡稱“財”爲宜，因中國各地各人各書古今簡稱不同，造成定義混亂，須注明，按各自習慣）。比如日幹爲甲，戊、辰、戌土就是偏財，己、醜，未土就是正財。
5、克我者爲殺官。同性爲偏官，或者七殺，簡稱殺；異性爲正官，簡稱官。比如日幹爲甲木，庚申爲七殺，辛酉爲正官。
十神之間的關系就是他們所在五行的關系。比如十神的相克關系，比克財，財克印，印克食傷，十神的其他關系依此類推。
日元星，比劫同。生食傷，克才財。殺官克，梟印生。
同性作用關系大，異性作用關系小，克優先於生。
日幹可以叫作日元、日主。乾造爲男命，坤造爲女命。

十神關系表（甲爲例）
五行
關系
陽　 同性
陰　 異性
木
同我
甲　比肩
乙　 劫財
火
我生
丙　 食神
丁　 傷官
土
我克
戊　 偏財
己　 正財
金
克我
庚　 七殺
辛　 正官
水
生我
壬　 偏印
癸　 正印


官殺爲陰陽木、印綬爲陰陽火、
比劫爲陰陽土、食傷爲陰陽金、
財星爲陰陽水。

正官功能
正官與日幹的關系是：正官是克制我（日幹）的。是陽幹見陰幹克，或陰幹見陽幹克。
正官的職能：是善意之管，譬如人類，必須遵從政府與法律管束。正官一般以吉神論。
正官的扶抑能力：衛財，生印，抑身，制劫。身強財弱，正官生印。日幹旺盛，正官拘身。日旺劫多，正官制劫。
七殺功能
七殺與日幹的關系：七殺是克制我（日幹）的，是陽幹見陽幹，陰幹見陰幹。
七殺的職能：殺身之對手，專以攻身爲尚，若無禮法制裁，必傷其主（日幹），故有制（有食神，傷官克制）謂之偏官，無制謂之七殺。一般以凶神論。
七殺的扶抑能力：耗財，生印，攻身，制劫。日強財弱，七殺耗財。日強印輕，七殺生印。印輕財重，七殺攻身。日強劫多，七殺制劫。
正偏財功能
正偏財與日幹的關系：正偏財是受我（日幹）克制的。正財是陽幹見陰幹，陰幹見陽幹；偏財是陽幹見陽幹，陰幹見陰幹。正偏財職能：是養命之源，人人所欲，但非人人所得，古今皆然。一般以吉神論。
財星的扶抑能力：生官殺，泄食傷，制梟神，壞正印。日旺官殺弱，財生官殺。日旺財弱，財泄食傷。日旺梟神旺，偏財制梟神。日旺正印旺，正財壞正印。
正偏印功能
正偏印是生我（日幹）的。正印是陽幹見陰幹，陰幹見陽幹；偏印是陽幹見陽幹，陰幹見陰幹。
正偏印職能：我之氣源，如父母生身之義。正印一般爲吉神，偏印一般爲凶神，又稱梟神，見食（食神）而奪爲梟神之故。
正偏印的扶抑能力：生身，泄官殺，御傷，挫食。日弱官殺強，印星泄官殺生身。日弱食傷重，正印御傷，偏印挫食。
傷官食神功能
傷食與日幹的關系：食傷是我（日幹）所生的。傷官是陽幹見陰幹，或陰幹見陽幹；食神是陽幹見陽幹，陰幹見陰幹。
食傷的職能：傷見官仗勢欺之，放任日幹於理法之外，故一般以凶神論；食見殺則能制服，使日幹得以安然無故，一般以吉神論。
食傷的扶抑能力：泄身，生財，敵殺，損官。身強財官弱，食傷泄身。身強財弱，食傷生財。身弱官殺重，食傷敵殺損官。
比劫職能
比劫與日幹的關系：比劫與我（日幹）同類。劫財是陽幹見陰幹，或陰幹見陽幹；比肩是陽幹見陽幹，陰幹見陰幹。比肩的職能：財之敵。日旺一般以凶神論。
比劫的扶抑能力：幫身，任官殺，化泄，奪財。日弱有比劫幫身，日弱有比劫任官殺，日弱有比劫不怕化泄，日旺有比劫奪財。

*/

// GetShiShenLongFromNumber 從數字獲取十神長名， 0-9
func GetShiShenLongFromNumber(nValue int) string {
	switch nValue {
	case 0:
		return "比肩"
	case 1:
		return "劫財"
	case 2:
		return "食神"
	case 3:
		return "傷官"
	case 4:
		return "偏財"
	case 5:
		return "正財"
	case 6:
		return "七殺"
	case 7:
		return "正官"
	case 8:
		return "偏印"
	case 9:
		return "正印"
	}
	return ""
}

// GetShiShenFromNumber 從數字獲得十神名, 0-9
func GetShiShenFromNumber(nValue int) string {
	switch nValue {
	case 0:
		return "比"
	case 1:
		return "劫"
	case 2:
		return "食"
	case 3:
		return "傷"
	case 4:
		return "才"
	case 5:
		return "財"
	case 6:
		return "殺"
	case 7:
		return "官"
	case 8:
		return "卩"
	case 9:
		return "印"
	}

	return ""
}

// NewShiShen 新建十神
func NewShiShen(nValue int) *TShiShen {
	nValue %= 10
	pShishen := TShiShen(nValue)
	return &pShishen

}

// 十神
var shishenlist = [...][10]int{
	{0, 1, 2, 3, 4, 5, 6, 7, 8, 9}, // 甲
	{1, 0, 3, 2, 5, 4, 7, 6, 9, 8}, // 乙
	{8, 9, 0, 1, 2, 3, 4, 5, 6, 7}, // 丙
	{9, 8, 1, 0, 3, 2, 5, 4, 7, 6}, // 丁
	{6, 7, 8, 9, 0, 1, 2, 3, 4, 5}, // 戊
	{7, 6, 9, 8, 1, 0, 3, 2, 5, 4}, // 己
	{4, 5, 6, 7, 8, 9, 0, 1, 2, 3}, // 庚
	{5, 4, 7, 6, 9, 8, 1, 0, 3, 2}, // 辛
	{2, 3, 4, 5, 6, 7, 8, 9, 0, 1}, // 壬
	{3, 2, 5, 4, 7, 6, 9, 8, 1, 0}} // 癸

// NewShiShenFromGan 從日幹和目標幹獲取十神
// nDayGan 日幹 Gan2 目標幹
func NewShiShenFromGan(nDayGan int, pGan2 *TGan) *TShiShen {
	return NewShiShen(shishenlist[nDayGan][pGan2.Value()])
}

// ToString 轉換成可閱讀的字符串
func (m *TShiShen) ToString() string {
	return m.String()
}

// ToInt 轉換成int
func (m *TShiShen) ToInt() int {
	return m.Value()
}

// TShiShen 十神
type TShiShen int

// Value 轉換成int
func (m *TShiShen) Value() int {
	return (int)(*m)
}

// String 轉換成可閱讀的字符串
func (m *TShiShen) String() string {
	return GetShiShenFromNumber(m.Value())
}
